trade_exp/src/Documents/ЗаказНаДоставкуОтПоставщика/ЗаказНаДоставкуОтПоставщика.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаДоставкуОтПоставщика</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="9108def1-74b6-49f6-826d-411b4f378a62">
    <name>Клиент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf2dbe71-1e2e-44dd-8f86-3a17b80c2b50">
    <name>ПрибытиеНаВыгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="80353671-e282-4b56-8dce-2a57668ab838">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dfe24e2d-676b-48a5-a9b8-3c5f0b13acc6">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="455e72aa-afaf-45cd-9f49-31780b117de1">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="88892e7e-ed4c-4ff9-9e78-07befff4e04a">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a2e9879-cef7-42dd-905f-482b6a2f455a">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="86982b60-862a-4887-ba01-a08bc79f03c6">
    <name>ТипУпаковки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f108f560-b4a5-4574-bd00-9c07fe772f24">
    <name>СтоимостьДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9430bac8-9a15-40d7-aa10-3adfdb59c859">
    <name>ТранзитФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fcf9d9ba-0906-4ffc-9e5e-737f64099517">
    <name>ПрибытиеНаПогрузку</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="d780eac6-c9c8-4c2f-852c-10736a66bfd6">
    <name>ИнтервалНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2044c9b2-8129-4e36-9f45-71da4032cde7">
    <name>ВремяНаПогрузкеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="735e0970-9985-412c-a81f-2c90d6cb07d3">
    <name>МаксимальнаяДлина</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c7b12af0-6c5d-49b7-a923-925de351a6bf">
    <name>НаименованиеГруза</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0258e270-c945-45b7-9b29-400d7f52e81c">
    <name>ВремяНаВыгрузкеС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="eb5d3130-09a9-492d-b99b-014e0a261c51">
    <name>ВремяНаПогрузкеПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0143b187-4422-4fe8-969a-7ba96e241605">
    <name>АдресНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f56e03a7-c4af-4ed3-b43a-e18714951dd2">
    <name>ТелефонНаПогрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="52d79523-9883-43fe-aed3-302fe7eb6ebe">
    <name>ИнтервалНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0c0375cd-d0c9-4885-97e6-dfa91b0458f7">
    <name>ВремяНаВыгрузкеПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fe254e26-2b30-4311-a001-839a5b565611">
    <name>КоличествоМест</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c30b0ea6-027c-49fa-8637-dc11fd260b8c">
    <name>КонтрагентКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d40ac935-ba6c-4dfc-95dc-42dd2c509023">
    <name>ФилиалВыгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="84a4d445-3c12-4ced-b011-00a1d0cc5f10">
    <name>АдресНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="fe589a13-9652-4e80-a67c-daaecc2e76dc">
    <name>ТелефонНаВыгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="03649d03-61d7-4d00-aad8-b57d6b16b8cc">
    <name>СсылкаБитрикс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7fb39d2e-07c5-4a8e-91cd-fbeecd9241ff">
    <name>Транзит</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ec493491-1e4b-4c54-afa5-c6540c966861">
    <name>СтоимостьТовара</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="2a47fe91-e454-4a30-948a-b860a45251f9">
    <name>НаправлениеДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7b68ea76-f8ba-4e00-a6e6-0bfa3d88a69d">
    <name>ДоверенностьНаСумму</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="331761b3-207b-4f40-b3a4-cfa35eae35cb">
    <name>Вес</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3eeb0f84-a6a0-44ea-bc0e-3a7c773ae588">
    <name>Объем</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="dbf76a4e-cc67-4e12-871f-a782770ccfd1">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c16b4556-8131-40e1-b044-7e7acc8ab2d6">
    <name>КоличествоДнейНаВывозЗаказа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="481ac138-6530-4efd-abc8-d5cb7f871411">
    <name>ПоДокументу</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections extendedConfigurationObject="a848cef6-15c4-4d0f-8f9f-3ccb4cf548c2">
    <name>Основания</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="bae39f0f-a7b4-46fc-afc5-0fc2017cb0ee">
      <name>Документ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Catalogs/ИнтервалыДоставкиОтПоставщикаНаПогрузке/ИнтервалыДоставкиОтПоставщикаНаПогрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9f5352ad-2c86-49b9-a82f-83a2f25576a3">
  <name>ИнтервалыДоставкиОтПоставщикаНаПогрузке</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="d9202a8a-8c1b-4cd8-96d4-0605bdce3e0c">
    <name>Выходной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5c98d7d8-a587-4c34-9a39-1cb789bc4172">
    <name>ВремяС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="886b18c4-1c0b-4c7f-afb4-dbebb92d110e">
    <name>ВремяПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="899631cc-577b-409b-93ca-802bb5b5b960">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Catalogs/ИнтервалыДоставкиОтПоставщикаНаВыгрузке/ИнтервалыДоставкиОтПоставщикаНаВыгрузке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="9549e6a5-8824-4304-ad48-ee785e398aef">
  <name>ИнтервалыДоставкиОтПоставщикаНаВыгрузке</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="67d62594-7a96-4c0b-984f-fa4e4dd44f59">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="375f1531-6965-457d-8e4d-4ee46bbfa75d">
    <name>Выходной</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a492a7c8-474e-47d1-8e5c-b1c8e017f00b">
    <name>ВремяС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ed150f6f-333b-462d-94ae-a519bbbd5859">
    <name>ВремяПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
</mdclass:Catalog>

trade_exp/src/Documents/ЗаказНаДоставкуОтПоставщика/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ВыборОбъектДоставки(Результат, ДопПараметры) Экспорт
	Объект.АдресНаПогрузке= Результат;
КонецПроцедуры

&НаКлиенте
Процедура ПодставитьАдресПогрузки(Команда)

	ПараметрыФормы= Новый Структура("Владелец", Объект.Партнер);
	ОповещениеОвыборе= Новый ОписаниеОповещения("ВыборОбъектДоставки", ЭтотОбъект);
	ОткрытьФорму("Справочник.ОбъектыДоставки.Форма.Док_ФормаВыбораКарта", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОвыборе);
	
КонецПроцедуры

#Область СобытияФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяНаВыгрузкеС);
	ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяНаВыгрузкеПо);
	ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяНаПогрузкеС);
	ЗаполнитьСписокВыбораПоляВремени(Элементы.ВремяНаПогрузкеПо);
	
	ОбновитьДинамическийСписок();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	Если ИмеетПолныеПрава() Тогда
		Элементы.Организация.ТолькоПросмотр= Ложь;
		Элементы.Партнер.ТолькоПросмотр= Ложь;
		Элементы.Подразделение.ТолькоПросмотр= Ложь;
		Элементы.Контрагент.ТолькоПросмотр= Ложь;
	КонецЕсли;
	
	Элементы.Транзит.ТолькоПросмотр= ЗначениеЗаполнено(Объект.Клиент);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
	ОбновитьНадписи();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПослеВыбораАдреса(Результат, Параметры) Экспорт
	Если Результат <> Неопределено Тогда
		Объект.АдресДоставки=  Результат.Представление;
		Объект.Широта=  Результат.Широта;
		Объект.Долгота=  Результат.Долгота;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	УстановитьВидимостьДоступность();
	ОбновитьНадписи();
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


&НаКлиенте
Процедура ОснованияПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОбновитьДанныеПоОснованиямНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПослеУдаления(Элемент)
	ОбновитьДанныеПоОснованиямНаСервере();
	ОбновитьНадписи();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница = Элементы.СтраницаКарты Тогда
		ИнициализироватьКарту();
	Иначе
		ОбновитьДинамическийСписок();
	КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ОбновитьДинамическийСписок()
	мОснование= Новый Массив;
	Для Каждого стрОснование Из Объект.Основания Цикл
		мОснование.Добавить(стрОснование.Документ);
	КонецЦикла;
	ГруппаУслугДоставки= АльтерраОбщегоНазначения.ПолучитьГруппуУслугДоставкиОбщую();
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(ТоварОснований, "МассивДокументов", мОснование, Истина);
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Рейсы, "Ссылка", Объект.Ссылка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура РейсыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Документ= Элементы.Рейсы.ТекущиеДанные.Рейс;
	ОткрытьФорму("Документ.РейсОтПоставщика.ФормаОбъекта", Новый Структура("Ключ", Документ), ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИнтервалОтПоставщикаНаПогрузкеПриИзменении(Элемент)
	ИнтервалНаПогрузкеПриИзмененииСервер();
КонецПроцедуры
&НаСервере
Процедура ИнтервалНаПогрузкеПриИзмененииСервер()
	Если ЗначениеЗаполнено(Объект.ИнтервалНаПогрузке) Тогда
		Объект.ВремяНаПогрузкеС= Объект.ИнтервалНаПогрузке.ВремяС;
		Объект.ВремяНаПогрузкеПо= Объект.ИнтервалНаПогрузке.ВремяПО;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ИнтервалОтПоставщикаНаПогрузкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	ПараметрыФормы= Новый Структура("Контрагент", Объект.Контрагент);
	ОповещениеОвыборе= Новый ОписаниеОповещения("ВыборИнтервалаНаПогрузке", ЭтотОбъект);
	ОткрытьФорму("Справочник.ИнтервалыДоставкиОтПоставщикаНаПогрузке.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОвыборе);
КонецПроцедуры
&НаКлиенте
Процедура ВыборИнтервалаНаПогрузке(Результат, ДопПараметры) Экспорт
	Объект.ИнтервалНаПогрузке= Результат;
	ИнтервалНаПогрузкеПриИзмененииСервер();
КонецПроцедуры





&НаКлиенте
Процедура ИнтервалОтПоставщикаНаВыгрузкеПриИзменении(Элемент)
	ИнтервалНаВыгрузкеПриИзмененииСервер();
КонецПроцедуры
&НаСервере
Процедура ИнтервалНаВыгрузкеПриИзмененииСервер()
	Если ЗначениеЗаполнено(Объект.ИнтервалНаВыгрузке) Тогда
		Объект.ВремяНаВыгрузкеС= Объект.ИнтервалНаВыгрузке.ВремяС;
		Объект.ВремяНаВыгрузкеПо= Объект.ИнтервалНаВыгрузке.ВремяПО;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура ИнтервалОтПоставщикаНаВыгрузкеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	ПараметрыФормы= Новый Структура("Подразделение", Объект.Подразделение);
	ОповещениеОвыборе= Новый ОписаниеОповещения("ВыборИнтервалаНаВыгрузке", ЭтотОбъект);
	ОткрытьФорму("Справочник.ИнтервалыДоставкиОтПоставщикаНаВыгрузке.ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОвыборе);
КонецПроцедуры
&НаКлиенте
Процедура ВыборИнтервалаНаВыгрузке(Результат, ДопПараметры) Экспорт
	Объект.ИнтервалНаВыгрузке= Результат;
	ИнтервалНаВыгрузкеПриИзмененииСервер();
КонецПроцедуры

&НаКлиенте
Процедура ОснованияПередНачаломИзменения(Элемент, Отказ)
	Отказ= Истина;
КонецПроцедуры

&НаКлиенте
Процедура ФилиалВыгрузкиПриИзменении(Элемент)
	Объект.АдресНаВыгрузке= АльтерраОбщегоНазначения.ПолучитьАдресФилиала(Объект.ФилиалВыгрузки);
КонецПроцедуры

&НаКлиенте
Процедура ТранзитПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры
#КонецОбласти

#Область КомандыФормы

&НаКлиенте
Процедура ПоказатьДвижения(Команда)
	ОткрытьФорму("Отчет.ДвиженияДокумента.Форма", Новый Структура("Документ", Объект.Ссылка));
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОснование(Команда)
	ДокументОснование= Элементы.Основания.ТекущиеДанные.Документ;
	АльтерраОбщегоНазначенияКлиент.ОткрытьДокументПоступления(ДокументОснование, ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСсылкуБитрикс(Команда)
	ОповещениеУстановитьСсылкуБитрикс= Новый ОписаниеОповещения("УстановитьСсылкуБитриксЗавершение", ЭтотОбъект);
	ПоказатьВводСтроки(ОповещениеУстановитьСсылкуБитрикс, "", "Вставьте ссылку на задачу в Битрикс24");
КонецПроцедуры
&НаКлиенте
Процедура УстановитьСсылкуБитриксЗавершение(СтрокаВвода, ДопПараметры) Экспорт
	Если не ПустаяСтрока(СтрокаВвода) Тогда
		Объект.СсылкаБитрикс= СтрокаВвода;
		ЭтаФорма.Модифицированность= Истина;
	КонецЕсли;
КонецПроцедуры
&НаКлиенте
Процедура СсылкаБитриксНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка= Ложь;
	ЗапуститьПриложение(Объект.СсылкаБитрикс);
КонецПроцедуры

&НаКлиенте
Процедура ПартнерПриИзменении(Элемент)
	ПерезаполнитьШапку();
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	ПерезаполнитьШапку();
КонецПроцедуры

#КонецОбласти

#Область Доставка
Процедура ЗаполнитьСписокВыбораПоляВремени(ПолеВводаФормы, Интервал = 3600) Экспорт
	
	ПолеВводаФормы.СписокВыбора.Очистить();
	
	НачалоРабочегоДня      = '00010101000000';
	ОкончаниеРабочегоДня   = '00010101220000';
	
	ВремяСписка = НачалоРабочегоДня;
	ТекДата= Дата(0001,01,01, Час(ТекущаяДата()), Минута(ТекущаяДата()), 01);
	Пока ВремяСписка <= ОкончаниеРабочегоДня Цикл
		//Пропускаем прошедшие интервалы
		Если ВремяСписка <  ТекДата Тогда
			ВремяСписка = ВремяСписка + Интервал;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВремяСписка) Тогда
			ПолеВводаФормы.СписокВыбора.Добавить(ВремяСписка + 1, "00:00"); // непустое значение
		Иначе
			ПолеВводаФормы.СписокВыбора.Добавить(ВремяСписка, Формат(ВремяСписка,"ДФ=ЧЧ:мм"));
		КонецЕсли;
		
		ВремяСписка = ВремяСписка + Интервал;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиПриИзменении(Элемент)
	
	ИмяРеквизитаАдресаДоставки = Элемент.Имя;
	
	ДоставкаТоваровКлиент.ПриИзмененииПредставленияАдреса(
	Элемент,
	Объект[ИмяРеквизитаАдресаДоставки],
	Объект[ИмяРеквизитаАдресаДоставки + "ЗначенияПолей"]);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОчистка(Элемент, СтандартнаяОбработка)
	
	АдресДоставкиПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	СтандартнаяОбработка = ЛОЖЬ;
//	ПараметрыФормы= Новый Структура("АдресНаПогрузке", Объект.АдресНаПогрузке);
///	ОповещениеОвыборе= Новый ОписаниеОповещения("ВыборОбъектДоставки", ЭтотОбъект);
//	ОткрытьФорму("Справочник.ОбъектыДоставки.ФормаЭлемента", ПараметрыФормы, ЭтаФорма,,,, ОповещениеОвыборе);
  ИмяРеквизита = Элемент.Имя;
	
	ИменаРеквизитовАдресовДоставки = ДоставкаТоваровКлиентСервер.ИменаРеквизитовАдресовДоставки("");
	
	ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставки = ИмяРеквизита;
	ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначение = ИмяРеквизита + "Значение";
	ИменаРеквизитовАдресовДоставки.ИмяРеквизитаАдресаДоставкиЗначенияПолей = ИмяРеквизита + "ЗначенияПолей";
	
	
	ДоставкаТоваровКлиент.ОткрытьФормуВыбораАдресаИОбработатьРезультат(
	Элемент,
	Объект,
	ИменаРеквизитовАдресовДоставки,
	СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресДоставкиОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресДоставкиПриИзменении(Элемент);
	
	ДоставкаТоваровКлиент.АдресДоставкиОбработкаВыбора(Элементы, Объект, Элемент.Имя, ВыбранноеЗначение);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУстановитьРеквизитыДоставкиСервер(ИмяЭлементаФормы);
	
	ДоставкаТоваров.ЗаполнитьРеквизитыДоставки(Элементы, ИмяЭлементаФормы, Объект)
	
КонецПроцедуры
#КонецОбласти

#Область Функционал
&НаСервере
Процедура ОбновитьДанныеПоОснованиямНаСервере()
	Если Объект.Основания.Количество() = 1 Тогда 
		Основание= Объект.Основания[0].Документ;
		Документы.ЗаказНаДоставкуОтПоставщика.ЗаполнитьДанныеПоОснованию(Основание, Объект);
	КонецЕсли;
	Документы.ЗаказНаДоставкуОтПоставщика.ОбновитьИтогиПоОснованиям(Объект);
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьШапку()
	Документы.ЗаказНаДоставкуОтПоставщика.ОбновитьРеквизитыДоставки(Объект);
	
	Документы.ЗаказНаДоставкуОтПоставщика.ОбновитьИтогиПоОснованиям(Объект);
КонецПроцедуры

&НаСервере
Функция ИмеетПолныеПрава() 
	Возврат РольДоступна("ПолныеПрава");
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Элементы.АдресНаВыгрузке.ТолькоПросмотр= Не Объект.Транзит;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНадписи()
	Если Объект.МаксимальнаяДлина >= 6 И Объект.МаксимальнаяДлина < 12 Тогда
		НадписьНегабарит = "Внимание 6-ти метровый  негабарит";
	ИначеЕсли Объект.МаксимальнаяДлина >= 12 Тогда
		НадписьНегабарит = "Внимание 12-ти метровый  негабарит";
	Иначе
		НадписьНегабарит= "";
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ИнициализацияКарты

&НаКлиенте
Процедура ИнициализироватьКарту()
	КартаЯндекс= "";
	КартаЯндекс= ПолучитьТекстМакета();
	ГеокодированиеКлиент.УстановитьНачальныеКоординаты(Объект.Подразделение, КартаЯндекс);
КонецПроцедуры
&НаСервере
Функция ПолучитьТекстМакета()
	Макет= ПолучитьОбщийМакет("МакетЯндексКарты");
	стрМакет = Макет.ПолучитьТекст();
	
	Документы.ЗаказНаДоставкуОтПоставщика.УбратьПодстановкиИзКода(стрМакет);
	
	Возврат стрМакет;
КонецФункции

&НаКлиенте
Процедура ОчиститьКарту(Команда)
	ИнициализироватьКарту();
КонецПроцедуры
#КонецОбласти

#Область Карта
&НаКлиенте
Процедура ПостроитьМаршрут(Команда)
		//Маршрут
	ПараметрыМаршрута= ПолучитьМассивАдресов();
	ЯндексКарта= Элементы.КартаЯндекс;	
	Элементы.КартаЯндекс.document.getElementById("WebClientOperation").value = "calcRouter(" + ПараметрыМаршрута + ")";
	Элементы.КартаЯндекс.document.getElementById("WebClient").click();
КонецПроцедуры
&НаКлиенте
Функция ПолучитьМассивАдресов()
	Результат = "";
	
	Результат = Результат + "[""" +Объект.АдресНаПогрузке;
	
	Результат = Результат + """,""" + Объект.АдресНаВыгрузке;

	Результат= Результат + """]";
	
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		СФП_МаркерыКлиент.МаркерНачало("Заказ на доставку от поставщика: Проведение из формы", Объект.Номер);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти


#Область ЭТрН

&НаКлиенте
Процедура ОбновитьЭТрННажатие(Элемент)  
	ОбновитьКомандыЭТрН();
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьКомандыЭТрН();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКомандыЭТрН()
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		УдалитьДинамическиеДекорацииЭТрН();
	
		//Запрос = Новый Запрос;
		//Запрос.Текст =	
		//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
		//	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Накладная.Ссылка) КАК Идентификатор,
		//	|	ПРЕДСТАВЛЕНИЕ(Накладная.Ссылка) КАК НакладнаяПредставление
		//	|ИЗ
		//	|	Документ.Saby_ТранспортнаяНакладная.ЗаказыНаДоставкуОтПоставщика КАК Накладная
		//	|ГДЕ
		//	|	Накладная.Заказ = &Заказ
		//	|	И НЕ Накладная.Ссылка.ПометкаУдаления";

		//Запрос.УстановитьПараметр("Заказ", Объект.Ссылка);

		//Выборка = Запрос.Выполнить().Выбрать();
		//Пока Выборка.Следующий() Цикл
		//	Элемент = Элементы.Добавить("Накладная" + СтрЗаменить(Строка(Выборка.Идентификатор), "-", "_"), Тип("ДекорацияФормы"), Элементы.ДинамическиеДекорацииЭТрН); 
		//	Элемент.Вид = ВидДекорацииФормы.Надпись;
		//	Элемент.Заголовок = Выборка.НакладнаяПредставление;
		//	Элемент.Гиперссылка = Истина;
		//	Элемент.Ширина = 45;
		//	Элемент.ГоризонтальноеПоложениеВГруппе = ГоризонтальноеПоложениеЭлемента.Центр;
		//	Элемент.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Центр;
		//	Элемент.УстановитьДействие("Нажатие", "ОткрытьСсылкуЭТрН"); 
		//КонецЦикла; 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьДинамическиеДекорацииЭТрН()    
	Массив = Элементы.ДинамическиеДекорацииЭТрН.ПодчиненныеЭлементы;
	Если ЗначениеЗаполнено(Массив) Тогда
		Элементы.Удалить(Массив[0]);
		УдалитьДинамическиеДекорацииЭТрН();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСсылкуЭТрН(Элемент)  
	//ПоказатьЗначение(, СсылкаЭТрН(СтрЗаменить(СтрЗаменить(Элемент.Имя, "_", "-"), "Накладная", "")));
КонецПроцедуры

//&НаСервере
//Функция СсылкаЭТрН(УИД)  
//	Возврат Документы.Saby_ТранспортнаяНакладная.ПолучитьСсылку(Новый УникальныйИдентификатор(УИД));
//КонецФункции

#КонецОбласти
